Revit 2026 API

# RectangleLightShape(RectangleLightShape) Constructor

---

Creates a copy of the given rectangle light shape

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RectangleLightShape(
	RectangleLightShape other
)
```
```vb
Public Sub New (
	other As RectangleLightShape
)
```
```cpp
public:
RectangleLightShape(
	RectangleLightShape^ other
)
```
```fsharp
new :
        other : RectangleLightShape -> RectangleLightShape
```

#### Parameters

other RectangleLightShape

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

RectangleLightShape Class

RectangleLightShape Overload

Autodesk.Revit.DB.Lighting Namespace